{"review_id":"SKJ48iTu7ZD6d5lgTaKe0A","user_id":"yG00-Dcv5iFS2SaezGu-Kw","business_id":"e13SEvJud_vgeDR_doL4sQ","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"Came here for lunch as we couldn't decide where to go and just ended up here\n\nIt started off great with us being seated fast and our waitress being at the table helping us with the menu and explaining specials. I ordered the carne asada plate and the rest of our table ordered. That is about where the great service stopped. A couple other people came after and it seemed that her service went to the other 2 tables as they got their food before us even after being seated well after us and they had their bill paid and left well before we could even get her attention for the bill. After getting the bill we had to sit around even more waiting for her to get it and return our card. This is the loss of the 2 stars as poor service can ruin an experience\n\nThe food was pretty good though. My carne asada was very moist and very flavorful. I was able to make a burrito with it as they serviced it with chorizo beans, rice, and guacamole and sour cream and a tortilla. They also served some potatoes with it but they were meh at the best. Still had extra carne asada which was very nice as I was able to eat it alone and it was good. The chips and salsa was good and they had this tomatillo salsa that was great\n\nOverall, I'd probably return but not if I was in a hurry or had to meet people somewhere","date":"2012-05-29 04:07:14"}
{"review_id":"mSVwVCpVW2w2ubQq48Ntnw","user_id":"MGIfvuAcgbUtRnhWa_Jm2g","business_id":"pKk7jCFIm96qDdk0laVT2w","stars":2.0,"useful":5,"funny":2,"cool":3,"text":"Had to send the steak back 3 times- unacceptable-\n\nmedium rare should not be a difficult task for an establishment that considers itself a steak house-  \n\nall the sides were great (all i got to eat since they never prepared the steak appropriately) especially the little fries\n\nhere is the steak experience\nask for medium rare\nreceive blood flowing raw\nsend back\nreceive charred on the outside no flowing blood but still clearly raw\nsend back\nreceive new steak- i tell the waiter to stay and watch, even before cutting i can tell that this steak (which is again charred on the outside) will again be raw\nno steak for me this night\n\nmanager makes cursory attempt at apology, takes steak off, gee big thank you there considering i didn't eat it, nothing else was comped, i figure since my wife pretty much ate alone that they would have made up a little more-  dont think i ever paid over $200 for a meal i didnt get to eat before, and i dont intend on doing it again\n\neat any where else in the hotel and you are sure to enjoy yourself,  would be really hard for me to consider giving this place another shot with all the other options in Vegas","date":"2007-12-11 06:30:11"}
{"review_id":"7gd7-BJuRsQv004gGrgwyg","user_id":"RUTq8KZCQOF5AkvEGPBMsQ","business_id":"U6Jf5-cUyxkMbXdxLLq6IA","stars":4.0,"useful":0,"funny":0,"cool":1,"text":"Great stop for a late night desert!  After a delicious dinner at Laurier Gordon Ramsey next door we stopped at Juliette et Chocolate for desert.  The wait was long but worth it.  During our last visit to Montreal we went to the sister location on St. Laurent.  The Laurier location is the same in terms of food quality just a bit \"fancier\" spot with newer decor.  I would strongly recommend the molten chocolate cake with carmel topping.  For chocolate fans that have been to Angelina in Paris, this feels like a scaled down version of that over the top choclate stop and well worth the visit.","date":"2011-12-01 00:10:04"}
{"review_id":"YfQNFHH8ZC9brvS7fALMUQ","user_id":"Gh_dAuNkz2jP_H-AzRU3Pw","business_id":"R05ZRXWkYuEcvRGok5fiDA","stars":1.0,"useful":2,"funny":0,"cool":0,"text":"I will not be going back to this place. I got a complete car wash service done from here--the actual service was average\/okay. I later noticed that the back seat car mat was missing and called them back to complain. I was told that someone would be contacting me back but nobody did. So about a week later I called them again and was promised that someone would be calling me back within a day or so. Again no phone call. I've since stopped calling  but have vowed to never use this location again. I completely understand that someone might have forgotten to put back the mat in the car--mistakes happen. However it's not acceptable to never respond to an inquiry after 2 calls.","date":"2015-07-16 18:26:30"}
{"review_id":"Xew7TqMjGb0pO6sIBb9yKA","user_id":"oqWg82I9dDz5MzyYDujWNg","business_id":"yvPkA1ZXz1M59G6e64jZGw","stars":1.0,"useful":1,"funny":0,"cool":0,"text":"I've had to go back now twice in 5 weeks for a terrible cut and a perm that did not work.  After consultation with the stylist I explained my hair doesn't take perms easily.  Instead of listening to me, she proceeded to leave the solution in my hair for 45 minutes, and only after I complained about it burning my scalp did she have her assistant rinse and neutralize my hair.  She was rude and unprofessional.  She has also told me to not come back even though the issue was her fault.  I suggest skipping Etch.  Scottsdale has many more salons to offer.","date":"2011-03-21 02:18:57"}
{"review_id":"AwypquEM51yworKAOT1Lng","user_id":"gnXv1DIrfD6ZJmVr9lY0Gw","business_id":"KTPRYqiFdLowAUEAnN7e3g","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"We recently went to Burgatory and it was amazing.\n  \nI made my own burger creation which included the following:\nHormone Free Beef, Brioche bun, Sweet Onion Rub, Buffalo Cheddar, Habanero Jelly Sauce, Baby Spinach, Organic Field Greens, Arugula and Sliced Tomato with free chips on the side. And I love it!!! Most delicious burger ever!!! There was a sweet taste with a spicy sensation. Very unique taste! \n\nAlso our server was friendly and helpful; however, the service was a bit slow since it was very busy and packed. \n\nOverall, I highly recommend everyone to try this place out.","date":"2014-10-27 16:44:53"}
{"review_id":"8eHpDZK8-5BtAfn8GwOkkg","user_id":"x4lz8zdb0V72mvK7S5sDcg","business_id":"c0Xf_aFHwWu1-35gu6m-Rw","stars":3.0,"useful":1,"funny":0,"cool":0,"text":"Hmm. Ultimately a hotel is a place to sleep and this one was pretty good at that. And it was a reasonable price for being downtown. But I can't count the number of times that my friends and I (there were 7 of us in 3 rooms) said, \"this is a really weird hotel...\"\n - you pay before your stay\n - the rooms have numeric keypad entries like houses can have. So remember to lock your door when you leave! We didn't realize this initially\n - the suites with kitchenettes are handy, modern, but very ikea. \n - the rooms are incredibly hot. The little home sized air conditioning unit doesn't quite do the trick. \n - our shower plugged up and wouldn't drain on first use. I went down to front desk, they were very pleasant and said they'd send someone the next morning, that they couldn't switch us rooms because the hotel was fully booked. Understandable. At 2pm the next day someone came to look at our shower. Good thing I'd found the plunger labeled 'for shower\/sink only' and fixed it myself because we had to be at a wedding by 3. \n - the morning of our checkout a woman knocked on our door at 9:30 to ask when we'd be ready to checkout. Well, considering checkout is 11, probably around then. (Our room was missing its 'do not disturb' sign). \n\nSo. We had a fine time. The TV worked and the beds were comfortable. It did the trick. But we probably wouldn't stay again.","date":"2015-05-12 16:21:22"}
{"review_id":"IfB8IWoQg9OtfgUjcBBjOw","user_id":"1dZRlydcm6E5Lrz7bGnbNA","business_id":"MBekdd_f7S1ezEzZb3o_ZA","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Had to run to WalMart last night and decided to see if this Chandler store had opened yet.  When I walked in I saw tray after tray of gorgeous cupcakes and just could not decide what to try.  The very cute, nice guy working behind the counter asked what I liked.  I said peanut butter and he suggested the *something* Elvis cupcake (can't remember right now).  It was banana cake with peanut butter frosting with little chocolate chips on top and a little glitter to it.\n\nAll I can say is, next time I will eat 1\/2 at a sitting.  Holy cow!  It was the best cupcake I'd ever had but I ate the whole thing and felt a bit more than full afterwards.  The frosting was delicious but a little rich, the cake was moist and perfect.  \n\nThis place will be the destruction of my good eating habits for sure.  Thankfully, I don't go to WalMart all that often ... but I WILL be back.  Too many amazing flavors I want to try. ;)","date":"2011-07-28 16:18:36"}
{"review_id":"sWj3v19M28NMdCaZ6B7O7A","user_id":"0bT_Dw4-nEwcvIS_NYcsEA","business_id":"OD61KMut0q5t2XBMZazFeA","stars":1.0,"useful":2,"funny":2,"cool":1,"text":"Red Robin tonight \n\nServer: \"What temp would you like on your burger\"\nMe: \"medium rare\"\nServer: \"so a little pink?\"\nMe: \"yes\"\n\nFood delivered...WELL done. Why do you ask if you can't deliver?!?  Anywho, I talk to the manager face to face. She says \"oh, it's on a conveyer belt...we can't do pink\". To which I say \"why would the server offer a choice?\" Her response, \"if you order the angus burger we can do more pink\". \n\nAre the servers not trained on what burger I order whether is \"regular\" or \"angus\" patties??  Then she continues to say \"well if you tell your server, they can do it\". Mmmmmmmkay, rewind...\"I just told the server I wanted a little pink\". The employee next to the manager said \"we can't because of food borne illnesses\". I'm so confused now.\n\nThis will be our last attempt at Red Robin.","date":"2016-12-04 03:59:17"}
{"review_id":"qS7D3jwLxkQ8Z6Yo36enog","user_id":"CxDOIDnH8gp9KXzpBHJYXw","business_id":"i6TgZAX3733aPIMnzje5-g","stars":2.0,"useful":0,"funny":0,"cool":0,"text":"2.5 star\n\nMy experience with Arepa is limited...  aside from having the Venezuelan style  Arepa at Arepa Cafe http:\/\/www.yelp.ca\/biz\/arepa-cafe-toronto#hrid:Pxplj67nbkQA-VCbm8_93w\/src:self which I thoroughly enjoyed. \n\nWhen my Yelp Friend suggested Arepiando, I am IN!\n\nPrices wise, Arepiando's Arepa is almost half of what Arepa Cafe is charging... but the location of course matters a lot!! Arepiando is located in a Latin American area up in North York, while Arepa Cafe is down in Queen St West. The set up of Arepiando is more like a takeout place where you can watch the cook\/cashier\/owner preparing your arepa through the glass window.\n\nArepiando might serves really authentic Colombia Arepa, but I didn't enjoy the white corn arepa as much, I found that it was just too crunchy and chewy.  Since in Colombia, Arepa usually eaten as Breakfast or Afternoon snacks, so most of the Arepa here at Arepiando has cheese and eggs as the main ingredients!\n\nMy Yelp Friend decided on: \n\nArepa con Chicharron ($5) - Fried Pork Skin with Cheese\n- So chewy... so dried... I am glad I still have all my teeth if not I won't be able to eat the pork... but I might have problem digesting it though\n- taste wise, it was pretty bland, the hot sauce on the side was pretty weak, I tried to dip it in the dressing.....\n\nArepa Ranchera ($4) - Eggs with Chorizo and Cheese\n- definitely a breakfast sandwich.. the scrambled eggs were really fluffy but unfortunately the sausages were on the dry side\n\nLulo Juice Cocktail ($1.50) and Strawberry Soda ($1.50)\n- My first experience with Lulo was good which has a citrus flavour\n- My friend's Strawberry Soda tasted just like cough syrup!! But he like cough syrup!\n\nThe lady was so nice, even gave us a chicken empanada to try... but the empanada was meh too... bland and dry...\n\nI really want to like Arepiando........ Maybe it is just me??","date":"2011-10-27 22:52:15"}
{"review_id":"K9acGxh_FvNeeQp0FF69BA","user_id":"LhDeEadNtD4ZGbC588vFPg","business_id":"OVczZ1qHXc3bjDprNvCKBQ","stars":5.0,"useful":3,"funny":0,"cool":0,"text":"This place has very good service for screen replacement services. I came across Desert Wireless through yelp and picked them because they had so many good reviews. It was definitely the the right choice. I replaced my iphone 6 glass and lcd screens for $165. They had it done pretty quickly and within the time frame they gave me. I would come here again if I need phone services in the future.","date":"2015-03-04 22:42:17"}
{"review_id":"kpBkUYCTO-CTzg9pZQXSiw","user_id":"E5Cq7K0sD7QHHQSDu1TLgg","business_id":"VYnokgAwo26T7jbCSTUUAg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Highly recommend Dr. Peterson.  He has been our optometrist for over 10 years.  He is honest, thorough and explains things in detail.  His staff is friendly and helpful.  He is the best in town!","date":"2018-07-07 21:43:03"}
{"review_id":"YTG65ZWkl0fre23RzqE07g","user_id":"9VNoBMBTI2AkQeHBCMvghQ","business_id":"ZCzey5aPhd7jYIoHsUfjmQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Always happy with Clever Koi. The menu is unique and the service is always good. I like how the owners all work there because you can tell they really care about their customers and the experience that they have.","date":"2016-03-17 20:27:32"}
{"review_id":"W6bRQkFpTfb_LVzlRDY8Jg","user_id":"WCyM70svcTPkMzb7P6evRg","business_id":"5v40NaLVbgvuGihm4ECJ0g","stars":3.0,"useful":1,"funny":0,"cool":1,"text":"Tried Bar Tepo for the first time tonight, thought it was pretty decent. I had heard from a friend that the Brown Sugar Hoisin Chicken Tacos were good so my wife and I tried them off of the tapas menu, they were very good. My wife commented that she would order the tacos from the dinner menu where they are also available. For dinner my wife had the Chicken Caesar Salad, the chicken was cooked very nicely with good seasoning, but the salad itself (at risk of sounding snobbish) was rather pedestrian. I had the Prime Rib Sandwich which was a really a French Dip sandwich. The sandwich was good but in my mind misrepresented on the menu. \n\nMy problem with this restaurant is that it is not sure what it wants to be. The decorating is very high end, but the food we received does not reflect the atmosphere. We will definitely be back and try the food again, hopefully I can raise my rating of this place. I really want it to be good.","date":"2008-08-19 01:59:21"}
{"review_id":"Vfbh7Mgg-XEzngTXpnziog","user_id":"KfPJXjy3uqvUHVc1LvFQgg","business_id":"-iPc_YSSqvM1CpZxxeUTXw","stars":4.0,"useful":1,"funny":0,"cool":1,"text":"On the 10 freeway heading for Tucson, hungry, pulled into an \"in and out burger\" no room at the inn! standing room only, so we bailed and a block away passed Jason's Deli Wow,it was great, fast and delicious. I have eaten at Cantors deli in West Hollywood and several famous Jewish delis Jasons was an equal.","date":"2008-12-05 03:38:36"}
{"review_id":"kVtpOyCm6N8TtzNAYPcPZQ","user_id":"H0_h8GCu0EYsX9i-GN7MRA","business_id":"5JW08_RL9K60Ubo8-8lyVg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Have known the owner, Ian, since grade 3 and was so excited to check out his restaurant!  Fantastic experience, cozy atmosphere, very friendly staff!  Incredible food and beautifully executed.\nCan't wait to go back!","date":"2018-02-01 20:56:56"}
{"review_id":"oxZODxJG3T4a6pXhV-yJIA","user_id":"KW50ysd2tbAL154bKSi3SA","business_id":"qFAw6wHMMcr4ctF-ZdGhEA","stars":4.0,"useful":2,"funny":1,"cool":1,"text":"I try my best to be honest and detailed so that other tourists can make an informed decision regarding visiting an establishment. \n\nMy wife and I were in Vegas looking for good Italian food. We searched Yelp and other resources and decided we wanted to try this restaurant. \n\nOur journey: this is not the restaurants fault, but worth noting. Not knowing how to get to this establishment we relied on the directory. BIG MISTAKE. no joke it took us 20 min to find this place. After asking, and looking at several directories ( that show \"you are here\" backwards from where you really are). At one point my wife and I were tempted to just eat any place, but it became a game to find this restaurant. Once here it was smaller than expected and kind of exposed to the mall. But we were happy to find it! \n\nThe service was superb! Wish I remembered our waiters name. A younger Italian gentleman. Super nice, checked on us at all the right times. Overall very good service. \n\nFood: we both had Caesar salads that were very good. I had chicken parmesan which was great and my wife had chicken Marsala. It was honestly very good food. \n\nOur bill came and it was \"cheap\" for Vegas, around $80 or so. Considering we had great service and good food I put $120 bucks in the binder and we finished our drinks. Our waitress took the bill, asked if we needed change and I said no you're all set. 2 min later he walked pasted us and thanked us which was nice. As we left he made it a point to thank us again saying he really appreciated it. I wasn't looking for that, but it was very nice of him. \n\nI recommend this place. No frills, small, but great food with good service.","date":"2016-09-06 03:49:09"}
{"review_id":"AYvHQQlwCMg7oGH7fOYMfg","user_id":"mksFinlYC_bDrc1k7VTG9w","business_id":"Wf5C8Amv_SlhoYE3_W66WQ","stars":5.0,"useful":6,"funny":1,"cool":2,"text":"Wow! I remember seeing this place open up near my apartment. Didn't look like much but me being the way I am insisted on trying it. Apparently it's everything I ever dreamed of: asian buffet (good quality food as opposed to the crap you find on most asian buffets), and ALL YOU CAN EAT SUSHI!\n\nWhen I found out about the ALL YOU CAN EAT SUSHI I kinda felt unnerved at the idea, presuming it would most likely be pretty gross. Man was I ever proved wrong. I have eaten in a lot of Toronto's sushi joints and this place definitely has some of the best sushi in town.\n\nAs for the environment it is very clean. Washrooms are beautiful. Servers are all very nice when you can get their attention. Though they have gotten better. When we first started going in we were some of their first customers so we got astounding service. When the pace started to pick-up though we noticed the quality of service diminish. But they have made some good improvements. They're a new business so I'll give them a break this time I guess.\n\nIf there were any quirks about the place I'd have to point out it would be their hilarious selection of music. Some nights you will go in and it will be good ol asian music straight through. But other times we have been in there you get the classic asian music mixed with unbelievably random songs ranging from forgot about dre (Dr. Dre and Slim Shady) to what I think was a bootlegged Iron Maiden song. \n\nAll in all one of my favourite spots in the city if your looking for a good meal for an awesome price.\n\nSpeaking of price, lunch is from 1100-1600 and costs $10 for the buffet. After 1600 its $14. On weekend add $2 to both of those prices.\n\nAlso, Oishi Sushi was just recently licensed to serve liquor and their beer is dirt cheap at less than $4 a bottle (domestic)!!!\n\nIf your ever up in the Downsview area be sure to hit this place up. Would recommend over any Wasabi and maybe even over the Mandarine with Oishi Sushi introduction of Crab Legs to their dinner buffet!","date":"2009-05-21 16:20:42"}
{"review_id":"p8ZKtAkmkXDM3wz7wZyGHA","user_id":"x7Ytzuw-QE5k2M8xrZVTag","business_id":"XcUQ9IDYQGZx0M-vxEZGnQ","stars":1.0,"useful":1,"funny":0,"cool":0,"text":"Not sure this business is even open anymore. I emailed from website no response. I called from website 5 times in 5 days. No answer. And when I called from Yelp and says phones disconnected. Either closed or worst customer service in the world. Maybe if someone calls me back for an appointment I'll change my review.","date":"2016-09-30 22:39:50"}
{"review_id":"kIRpTAPo2qF_kEudZ6volg","user_id":"oz87x3iaEi17QgAqMCm1SQ","business_id":"h-psPOmlY0mCOflb3S3rdQ","stars":1.0,"useful":7,"funny":0,"cool":0,"text":"I don't know what to say, I love the food but as everyone says the service is terrible.\n\nPart of the reason is that the owners steal all of the tips from the waitresses. They make minimum wage, and all the tips go to the owners. \n\nI am torn. It is without question my favorite food, but the owners steal from the servers. So I don't think I should eat here.... Really disappointing...  What does one do in this case?.... \n\nThe other Indian restaurants around here are terrible. So I can drive to Tempe to support better practices for servers, or I can eat here and support thieves with delicious food.","date":"2014-06-28 00:46:18"}
{"review_id":"1M_n8OV6SnYFtQ3EsE0MFg","user_id":"K1gB4QXJe--Gh1rw4TjGWg","business_id":"De8Z9rLZOmf-icp3gDxCZA","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"I been to a great variety of south indian restaurant. This for me personally for just simply okay and it was not super impressive. It had a nice dining space, okay service and the food was decent. For me personally, I would go only once just to try it out. Not sure about the non-veg but the vegetarian options were good.","date":"2018-04-27 20:24:14"}
{"review_id":"YL4GHkr5QTFvXD64e5zH-g","user_id":"xqybfWaTzzst2ZlpWCjUNA","business_id":"rcaPajgKOJC2vo_l3xa42A","stars":4.0,"useful":16,"funny":11,"cool":12,"text":"With a party of 7, we booked a reservation for 6 and was easily added on an extra person when we got to the restaurant. Overall, food was prettttty good, but service was lacking for what the price of the restaurant. Service felt a bit disorganized. \n\nLet's start with their complimentary Baguette with jam and butter. Love their baguette - light, crisp, and perfect with their jam. I could just eat this for the meal. Cheese platter was one of the best I've had - it came with cow, sheep, and goat cheese; hard, medium, soft; mild, semi pungent. My favorite was the truffle cheese - oh man, the truffle flavor was strong. Along with the cheeses were honey comb, walnut, sliced apples, and delicious bread crisp with dried fruits. Pair the sweet offerings with the Cheese, it was a perfect flavor medley in the mouth. \n\nMoving onto my Omlette Du Jour - I was a bit disappointed. I was expecting a fluffier omlette, but I think my eggs were a bit over cooked. French Onion Soup was divine - the soup was reduced, the caramelized onion flavor really shined through, a bit salty as French Onion soup tends to be, cheese was perfect.","date":"2018-05-29 00:22:19"}
{"review_id":"_FWgZOnySFc8s270HpaieQ","user_id":"oUK6Xs5dPPnP4whFeZExGg","business_id":"2AcO-aHnBqx94dU2Z4Em2Q","stars":4.0,"useful":3,"funny":1,"cool":2,"text":"I like the Main Dish. I really do. Especially the part where they make me home cooked meals that I don't actually have to prep but I can still look like a rockstar for having on hand (when people ask if I make it, I just reply \"Of course it's homemade!\") Bests: meatloaf and lasagna. The rest is yummy too, but these two dishes in particular just taste better when they're coming out of somebody else's kitchen.\n\nBesides the takeaway options, TMD also has a pretty fantastic lunch counter. Go to the sandwich counter. It's the provolone to my prosciutto. And I hear pretty delicious reports on brunch, though I haven't managed to try that myself yet.\n\nIn other news, TMD also serves beer and wine at their little bar. Oh, and coffee. Seriously, what DOESN'T TMD do?\n\nIf you haven't been yet, and you're reading this, you are out of excuses. Go. Go directly to The Main Dish. Do not pass another eatery. Do not collect other nibbles to fill yourself up on.","date":"2012-06-26 05:44:29"}
{"review_id":"Q8vVZwrWxfJMjClzpDOzmA","user_id":"g-cCGz0Dx9ipums5jIbYmQ","business_id":"ZCzey5aPhd7jYIoHsUfjmQ","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"Their Pork Belly Ramen answered my craving for that crispy pork skin on layers of tender pork and a little pork fat. The soup stock is very flavorful and the noodles are just perfect! Their tuna chips and chicken wings are also good.  I also like the vibe in Clever Koi. I got to speak with one of the young owners. Very friendly. Highly recommending this place if you want something Asian with the LA vibe.","date":"2018-08-23 23:49:15"}
{"review_id":"5BamPu3BtJ6JY7-c3djQ7g","user_id":"Oz6DTbeD6m3z5LmnDdZdXw","business_id":"H1j34TgbrVZkxeww9xlJTw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"$8.00 for the meatiest, juiciest, and flavorful gyro! I wish that I paid more for the extra sauce! my only complaint!","date":"2012-12-04 22:38:32"}
{"review_id":"CAjWQLMak5IHwPice7u5Eg","user_id":"8SVOBWdAtEdZ23y-AkOUQQ","business_id":"bupMXFUaZfranBLdaVcRww","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"Came here with a couple friends and we got the 6 course meal, and it was amazing. Very fresh and delicious. I don't remember the names of all the dishes, there were a few hot dishes and nigiri\/sashimi plates. I loved the dessert, I got the matcha cheesecake with strawberry sorbet, my friends got the chocolate mousse with black sesame ice cream.","date":"2017-03-03 19:47:00"}
{"review_id":"rmd1FHG19LkvuqPOh7-Tbw","user_id":"gXHuqQqCxW8vP878tPKP0w","business_id":"k1c_bC3DK6mKg797vH1T8w","stars":4.0,"useful":1,"funny":0,"cool":1,"text":"My wife and I came here for our anniversary and loved the food.  We started off with the deep fried deviled eggs which were incredible. My wife ordered the short ribs and I ordered the Pork Oso Buco.  This ended up killing the conversation and we were both enthralled in eating our food and savoring each bite.  The only knock I have was on the desert which left us underwhelmed.  We ordered the chocolate dipped bacon s'mores which, after the great meal we had, didn't quite have the same impact as the apps and entrees.  The wait staff seemed to be slightly occupied but for the most part we felt taken care of.\n\nIt is definitely worth going to - but maybe try a different dessert.","date":"2014-06-27 22:49:09"}
{"review_id":"5UehYeVtyRvmQl6Zc9Orrw","user_id":"XjLvFaNKzzprEDRR-3kxsQ","business_id":"XZbuPXdyA0ZtTu3AzqtQhg","stars":2.0,"useful":1,"funny":2,"cool":0,"text":"We dined here on 06\/05\/14.\n\nWas super excited to celebrate my husband's birthday at this restaurant. \n\nThe waiter was extremely pushy regarding the drinks and I felt as though he was constantly rushing us through ordering and our meal.\n\nAppetizers were blue corn pancake with duck & blue corn lobster tacos. Both were OK. The duck was covered in a lot of sauce for my personal taste buds and was a touch boring. The taco was OK but very underwhelmed.\n\nI ordered the filet medium and husband ordered the NY strip medium. It was explained to us that medium was PINK. My steak was medium rare. I told the waiter and he said that was what he told me. OK waiter person, whatever you say. I just wasn't in the mood to fight with him.\n\nThe sides were very good. The horseradish twice baked potato and the corn cojita.\n\nWas disappointed in the dessert after just one bite.\n\nCredit Card was authorized for the total of the bill $194.00.\nAfter tip the total was $244.00 and that was also authorized on the credit card.\n\nThe $244.00 was charged on 06\/09\/14.\nThe authorization for $194.00 is still on my credit card as of 06\/11\/14.\n\nGrrr...","date":"2014-06-11 17:11:30"}
{"review_id":"nS7jemy0g8wjj3FHQYFATA","user_id":"KFWspiLBxtpfZ-8CdEaI3g","business_id":"tVyLQzyhhinKcGzlZIFZjQ","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Great place. I went there on the opening weekend and they had a waiting list. It did seem a little disorganized, people going this way, people going that way, I can't count that against them though. I am sure it will probably become a well oiled machine in the coming month or so. The one and only complaint I have is the wait for a pizza! There is a warning on the menu saying that there is a 40-60 minute wait for the pizza because it's hand made...really, an hour!? I love pizza and Uncle Bears, which is a 15 foot walk has equally as good of pizza when you consider that it's ready in 10 minutes. That said everyone was very nice.","date":"2011-03-20 06:10:54"}
{"review_id":"PT41KUsCzOmyNmywMBwoKQ","user_id":"RCWbNZSqAGkz5fN89fN6MA","business_id":"KUOa1acSFn6DkO9jp-sn6A","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"The food and presentation was good. I ordered the \"Burnt Ends-N-Rib\" combo with the Wilbur baked beans and corn on cob. A corn bread muffin is included.\n\nI sat at the bar. My only complaint was the bartender wasn't as attentive as he could have been. There were only 5 people at the bar, yet it was hit and miss for him to notice an obvious need such as an almost empty drink. At one point I got his attention for a drink, but after 5 minutes after not getting one, I had to get his attention again to finally get a drink. No apology that he had forgotten. To his slight defense he was also servicing the waitresses, but there wasn't hardly any orders coming through there. I used to manage a bar, and know that a good bartender should constantly be looking for obvious signs of customers in need of more service.","date":"2017-06-17 17:24:06"}
{"review_id":"7O0lNbh48T2CRwnIrW_5hg","user_id":"xqUn2yqxQRq5MrthbRb-7Q","business_id":"NFm869_w6cvVaWaNpAzjeA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"after 6 yrs in Charlotte finally made it in & it was worth every minute of the wait!  I had the ahi tuna watermon tacos & the ramen.  Simply oh la la!!  can't add any more to what everyone else has said to this marvelous place except create a phone in waiting list, accept reservations, & when is a bigger location to be opening & another location in the Ballantyne area.","date":"2016-08-04 01:10:45"}
{"review_id":"l3ltNA1ndSZ2jqw2w5rrDQ","user_id":"vaN-IGQxpRp6SGBpGePSJw","business_id":"F-X9R-QmNYcoWlQHuFW0_Q","stars":2.0,"useful":2,"funny":0,"cool":1,"text":"*2.5*\nSince my review from January, I have been going to Iam Yoga on a regular basis. I am sad to report, however, that they have gone downhill by A LOT. \n\nThe change rooms, which were the highlight of many people's experiences, are now  a nightmare. The showers no longer have the shampoo, conditioner and body wash that they once boasted, and the drain is constantly clogged. The shower heads have been broken on several occasions as well.\n\nI have also discovered that the after-work classes (5pm, 6:30pm and 8pm) get extremely packed and smelly. Luckily, I've been able to avoid those. \n\nThe lobby area, the practice room and the staff have remained alright, but the bathrooms really turn me off from continuing here now.","date":"2012-03-01 04:14:09"}
{"review_id":"YMb3p2_2PiKKYaAqjv81fw","user_id":"0bwKjVD1T9BLhW0n2UdbJg","business_id":"k2txj_3MKcZb07HbA9G45A","stars":3.0,"useful":4,"funny":0,"cool":1,"text":"I'm rating only three stars because of the staff working. The racing definitely was an experience and a lot of fun. However when we walked in no one was greeted or told where to sign in. After the asking the staff at the counter (who seem preoccupied socializing) we registered and were told to wait for our names to be called. In our group of 8 we were paired with another group of 7. No one asked us if we had raced before basically just \"watch this video\". The other group was clearly more experienced and very aggressive throughout our entire race. One of the racers actually got ejected from the race. We had paid for two races and after our first one were escorted out of the area. Confused we asked why and once again the staff was preoccupied to answer our questions. \n\nAll in all had a great time but don't expect to be greeted by anyone friendly or helpful.","date":"2016-01-30 03:58:26"}
{"review_id":"niPGjJgSiff_TQ2dRihoKQ","user_id":"52Xc4NqY5WO2jRhPmm4toQ","business_id":"XZbuPXdyA0ZtTu3AzqtQhg","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"I've been here once for brunch and honestly, I was expecting a little more for Bobby Flay's restaurant.  Don't get me wrong, I'm a huge fan and absolutely love him but I wasn't blown away with what I ordered, which was something with scrambled eggs.  I think I would have preferred and enjoyed something more off the Dinner menu.  \n\nBased on the reviews I'd def want to go back and give it a second chance (for dinner).","date":"2011-04-22 20:46:09"}
{"review_id":"gfPEx7FXqYwpldDyzHJyyw","user_id":"4Lih7V69TZ1VTNziz8rs9w","business_id":"SObOX1l8bkueylpptJOdmg","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"I really appreciate that the owner took the time to reach out to me after my last review. I really had a bad experience and the fact that the customer satisfaction is taken so seriously made me feel wonderful. I was comped a massage in lieu of the bad one, and ended up with Rony, a therapist who came highly recommended from the staff. My massage was very good and seemed to be an adequate \"make up massage\" comparatively, but it still wasn't great. I give the European massage school 4 stars because it really is a SCHOOL of aspiring professionals and they have not mastered their skills just yet. \nOverall, staff is amazing for working with me on this one, and the price is very exceptional for the amount of time you get on the massage table.","date":"2016-02-12 01:27:37"}
{"review_id":"Q410yysKYBXu6DpWlymQ8Q","user_id":"JeHByN-ByNVmqhBtkIL1Fw","business_id":"PaQkr2AR6JpLa_gTZXPrRA","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"If you are a CPR\/First Aid instructor, I DO NOT recommend renting CPR mannequins from these guys.  I rented mannequins from them for a large class and when I opened the bag, literally pieces of the mannequins fell out.  Only 2 out of 5 were even usable.  They were completely filthy and they were falling apart.  When I brought them back they said that I had done the damage because I didn't know how to use them.  What an insult.  I've been using these style mannequins for many years.  I highly recommend spending your money somewhere else if you expect good customer service, honesty, and integrity.","date":"2018-07-17 02:57:07"}
{"review_id":"CdRmnFeZivFXU551MBc_xw","user_id":"XfN72C38jVrxxEzARZBuCA","business_id":"Nwg2zxqjpdDj_ZiQ44ufWw","stars":5.0,"useful":0,"funny":1,"cool":0,"text":"We needed some odd size passport-type photos for a country in Europe as well as regular US passport photos.  We had gone to another store and they weren't helpful at all.  The folks at this PostNet went out of their way to help us out.  They researched the correct size online and then had their graphic designer size them to the correct specs.  They were friendly and knowledgeable, and in my opinion, went above and beyond.  I highly recommend this store for all your postal and printing needs.","date":"2015-07-28 10:52:57"}
{"review_id":"fhEccVjDgWVHozWVTjtJbg","user_id":"iYxEmwo_IVdgPwyRHTR6tA","business_id":"tqumNKvNmeII_DRG6SdRuw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Service was exceptional. The food was great. Coming all the way from Maryland on a Canadian family visit, we started off well with the food part. I had the Chicken Adana and my husband the Lam and we both loved it. \nOur server was the best. My oh My , can we get that in Maryland? Jk jk. Lol \nWe will definitely come back","date":"2017-09-09 01:33:50"}
{"review_id":"1F_lMA4XoXnTuQggiFmByw","user_id":"GqoQO_FXPp-gTuxRx3_AoQ","business_id":"308f__iS3Qw_qhnda6IVPw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Fact: high quality fish, screamingly fresh and exquisitely prepared is inherently expensive stuff, traditionally served in small portions. My sashimi dinner here was a steal at $20-some, albeit a very light supper. But a less experienced dining companion had real trouble negotiating the menu and left unsatisfied. If your concept of sushi is California rolls and the like you may want to put off a visit to Hiro. If you're looking for an undiluted Japanese sushi experience look no further.","date":"2010-05-14 15:08:54"}
{"review_id":"iqKJS82_zRkez0hStxu4WQ","user_id":"tG24pgYOAyEONNhgmhVO-Q","business_id":"0TCn9BonClf7NUeoewCu9g","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"You know this place is going to be good when you walk in and everyone there is Greek. It feels so warm and friendly as the staff there is super attentive and it almost feels like you're in Greece (or what I imagine Greece would be like). The food here is absolutely delicious. I got the special which was fish. It was a bit on the pricier side ($20 for salad, fish and fries) but SO worth it. The fish was nice and crispy however it was literally as though they took the fish without cleaning it and just fried it. There were so many bones that is was a bit painful to eat. The fries were perfectly crispy. My friends got the pork souvlaki  and the ground beef dish which they all really enjoyed. The meals are big and I would say they're large enough to feed two people at a satisfied state (provided they're not heavy eaters). Will definitely stop by again!","date":"2017-11-06 16:22:08"}
{"review_id":"XGm0GJ-qxJoPpsTVUQ8KUQ","user_id":"JCoii5NF6FeQGwgG9XuVtw","business_id":"CzqYP9VKJBzGLnp14naScA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Delicious!  This has to be one of the best airport restaurants I have eaten at.  I ordered the Tortilla soup as an appetizer and the Green Chili Cheeseburger with Fries for my entree.  The soup was flavorful and well seasoned with just the right amount of kick.  The cheeseburger was moist and tender, cooked to perfection.  The green chili is warm, but not extremely hot.  The seasoned french fries are superb - hot, crunchy, with just the right amount of seasoning.  I would highly recommend a stop at this restaurant when passing through Sky Harbor.","date":"2015-09-24 00:17:07"}
{"review_id":"mraP9kXOM1SnlR-DAla-eA","user_id":"RlpO5-CES8ze1xu7lab0qg","business_id":"0FUtlsQrJI7LhqDPxLumEw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Excellent breakfast and a fun place to go with kids! We have only ever had breakfast here, and on their breakfast menu the waffles amazing! The breakfast tacos and scramble bowls are excellent too.","date":"2014-05-07 17:30:58"}
{"review_id":"d9e8zagpmhgw6-MbTaaLGA","user_id":"ocKrsIZGoVfrWUAjp1B2iw","business_id":"aYyj9OdH059CoEXadmldXA","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Good music. Good food. Good staff. Yellowtail appetizer is amazing and prices are fair.","date":"2016-12-04 03:47:02"}
{"review_id":"-VGAn6t_2p44fd37w1IR8Q","user_id":"hxbbmH1-oZsYWn4qtf6Itg","business_id":"wKmDYX_XuYCbIerCbYfWnQ","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"Going in not sure what to expect, I was pleasantly surprised by the atmosphere, service, and quantity of food as it felt like a buffet. We got the shrimps and chicken slices with a side of fried rice which I would highly recommend getting. It's definitely a fun experience going with Friends or taking someone out on a really casual date as you eat with a bib and gloves. However, the only con I would say is the morning after as it's a complete shit storm :D .Overall I'd give it 3 boils out of 5","date":"2017-04-07 22:19:12"}
{"review_id":"_aPOgFWp_uVISQ3Job1qkw","user_id":"FbzIjP59GbwOpPfEHhcU3w","business_id":"wArcCMVnrl_tc9MULW-0CQ","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"I really enjoyed my brunch! We were in a decent size group with a small baby and they were great about accommodating us! Since it's a buffet it seems that table turnover is slower than a normal restaurant, but they were great about putting tables together and making it work. \n\nAs for reviews that mentioned food not being served hot, I did not experience that at all. Everything that should have been in chaffing dishes was, and the staff was great about keeping all the food stocked. The buffet line can be long at times, but it really just depends on when you go up. The made to order omelette was a great option, though no one at my table ordered one. \n\nOverall great experience, and would be five stars if only North Carolina could serve alcohol before noon!","date":"2014-02-24 02:04:11"}
{"review_id":"F3YPpuNK0OKi2o280L-1OQ","user_id":"ChADwrKjusoOHLlU0v_iRg","business_id":"5CJL_2-XwCGBmOav4mFdYg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Chada Thai, Ocha, and Weera fans, you've got serious competition. This place has southern Thai food that rivals the best in town and beats street food in Bangkok. \n\nThai beef salad is incredible. Soups are great, and the noodle dishes have complex and spicy flavors. Even their dry chili has a smoky taste unlike the rest. \n\nOf that's enough, this place has soul. It's a late night spot, often busy after midnight. And there is usually someone playing on stage.","date":"2017-05-13 07:16:30"}
{"review_id":"f2A9AgRQXqE0ATF5kw15tg","user_id":"kkyRos76Bft-r1wshfx9BQ","business_id":"AqpiBApzrd30LA-vmU3Rvw","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"Absolutely terrible service.  The waitress ignored us while checking her nails.  Drinks are watered down and overpriced.  It's a 2 drink minimum and the entire place was empty.","date":"2015-01-03 21:56:04"}
{"review_id":"y1O9u1xLPdkkNZJYeGC0bQ","user_id":"09QcQYf_t1NEq_AkjJuABA","business_id":"CiNZmBtZRaRSXKjwun4R4A","stars":5.0,"useful":7,"funny":8,"cool":7,"text":"Yes! I'm officially addicted to this pizza. Honestly, the only good New York style pizza in Madison. I'm originally from New Jersey (yes, I am aware that is *not* New York) so I've missed a good thin crust.\n\nSo far, the eggplant pizza is my favorite. I mean, I've liked all the ones I had. I think the ratio of the ingredients is good.\n\nI ordered a salad yesterday to pretend like I was being healthy in addition to the giant slice of pizza I was going to consume. They give a good amount of salad! The feta in the Mediterranean salad is super yummy, though on the salty side.\n\nI went there again today, after ordering delivery yesterday. I don't plan on going tomorrow, but we will see.","date":"2018-02-11 03:03:16"}
{"review_id":"wqvFGQnhLbogx7FzwTATVQ","user_id":"tq8niGds0I6tm090esvxGA","business_id":"XZbuPXdyA0ZtTu3AzqtQhg","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"OK, I am a sucker for Queso Fundido, so my dining experience was off to an incredible start. The fundido was hot, but not scathing and had a great consistency. Then the blue corn tortilla with duck. The duck just melted.  \n\nI ordered dinner, not thinking about how full I would be from the appetizers, but I powered through.\n\nI ordered the 16 spice chicken. Just the right blend of spices (no I don't know what they were), the right amount of spicy, and the chicken was cooked perfectly.\n\nSo I was to full to have dessert.\n\nMy only complaint is that the staff stood around a lot, in full view. Which is really frustrating if you are waiting on something. As an added bonus we could hear them complain about other waitstaff, what they were doing after work... Really do that in the kitchen on on your own time. This knocks it down a star.","date":"2011-07-28 15:16:33"}
{"review_id":"njoZd0Kvtrz2ekt_TD1RqA","user_id":"eY6Tjah3VYebgYT0AZwh5A","business_id":"BxNhwgVNi2qsAco8388h5A","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"The service and food was fantastic! Definitely worth the visit.  Oh and make sure you try the margaritas!!","date":"2018-05-28 21:17:20"}
{"review_id":"_X3zq-c53-UU2jZt8_XJeg","user_id":"NF6-RIYueQv81aB3vJ7WMw","business_id":"Ec9CBmL3285XkeHaNp-bSQ","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Superb fusion of American and Vietnamese cuisine.  on the table are plates of oxtail fried rice, fried oysters, mekong river soup (made with beef, fishball, shrimp, and pork)... Dungeness crabs and Branzino.  \n\nAll entrees are well prepared and are an explosion of taste. Yummy to my tummy.  Can't wait to revisit.","date":"2014-10-27 02:18:55"}
{"review_id":"bCfJu1C7GNtTv5Apb7-MOA","user_id":"CQC2wIlzVW3Rdce8uiaF5g","business_id":"xfg0LsKrFClY73tapyG4Hg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I definitely recommend this vet office !They are really nice and Very helpful !The prices are good too! The vet tech was really nice and made my Ruger feel very comfortable! The vet is also an amazing person ! Ruger really liked her and warmed up to her fast! She prescribed him a good cocktail and made him all better!! \"He had an ear infection \"","date":"2018-08-04 23:35:47"}
{"review_id":"vaN1-Z7itu3UhbLqI2zXCA","user_id":"b8ZyMEjPKk95PunicOSboA","business_id":"P8IsTiHq5Hesa6UPL604ww","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Finally! A place for good tacos! I'm from southern CA and love Baja style tacos and finally found some here in AZ. Homemade refried beans were yummy too and good rice! I had a prickly pear margarita with my meal which was a bonus. It's in a strip mall and it feels fast-foody (you order at the counter) but I didn't mind that. Will definitely be back when I want Mexican food.","date":"2015-08-30 13:32:55"}
{"review_id":"NpVsRJQv3y3hG40_unIq3w","user_id":"UhSh3J9NE5ZV_GyH2kY3Sg","business_id":"V2oe1HVgNK0He9Mf3Q17AA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Here in Phoenix on business and tried this place.\nEverything is great, I had onion and cheese pierogis and still needed more so then tried potato and cheddar cheese equally great. Staff was super attentive and I would travel from California just to eat here.","date":"2015-10-23 13:56:02"}
{"review_id":"KWWfHc_FJULT79nPBTJdlg","user_id":"z97apzYAjXI-592ONz7b6w","business_id":"FMLJ7orzQQwWxfgeqrvlCQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This place is legit. I went for a Chicago style dog and they delivered 110%. The dog had a perfect \"pop\" when you bite into it (essential) and tasted just like it does in the states but with better tactics. The sports peppers are thinly chopped, which are the main difference. Other than that. Everything else tastes exactly the same. Spot on!","date":"2016-01-30 03:45:43"}
{"review_id":"8LKWcr9Am7G1dQtyBh4vFg","user_id":"c-AEz8tt7leZinzb7FyFpA","business_id":"24t7-XcaR6yJi_20CPoB2Q","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"My day was centered around visiting Sweetie Fry today as I wanted to totally treat myself to a gluttonous lunch.  I had to wait until they opened (2:30) but it was no problem as I hung out at Phoneix Coffee, right down the street.  I introduced myself  to the owner, Keith and was treated to sample after sample of all of the AMAZING flavors that he had to offer.  Pumpkin flavors will certainly steal the show this time of year and his small soup pot of salted caramel should not be missed,  he took the time to put caramel onto a small spoon for me to sample.  Goat Cheese with honey and walnuts was my choice after trying everything.  My head was reeling after so many wonderful samples.  Vegan-non dairy fruit sorbets are present for some nice variety and you can tell they stand behind the perfection in each flavor!  I can only hope that the strawberry sour cream will be there the next time I visit.  The color and flavor of this one was so fresh and reminded me of strawberries that we would pick and eat at the local strawberry patch in my hometown.\nAfter enjoying a perfect basket of fries with gorgonzola cheese and tabasco sauce, I was ready to commit to a few flavors of ice cream.  \nWhat was the most refreshing thing about my visit was the enthuiaism of the owner.  He is on to something here, especially if customers are so valued as I was!","date":"2013-10-03 22:39:32"}
{"review_id":"ZIr77DTeECPJUmi2LIjGfA","user_id":"HvMmidRmVBBc09AfHK3x3g","business_id":"M67Jq1BXsE5sQUoJd1q86w","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Saw a wonderful, not to be missed magic show featuring a great magician and juggler Craig Davis, his bird Peaches, and beautiful assistant\/belly dancer Myryka!  Mr. Davis' wife Jeanette also sings for the show, but wasn't able to be there singing tonight.\nThis show is G-rated, so you can bring the kids.  Great for all ages, and worth the drive to Scottsdale!","date":"2018-02-11 06:26:32"}
{"review_id":"FnkaaS2QMPx5UZk3huo0PA","user_id":"zSa7JJgMsnIALQcvqIzeXA","business_id":"KsWGy-WuTUm5ve5lFUOCfg","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"It's a good time, not sure it's worth $20, but hey. They have discounts for students and many other different discounts. It's a nice way to kill a couple hours, it's different.","date":"2018-02-01 19:47:17"}
{"review_id":"PYzfiDqFAthTd2FjHhR1cw","user_id":"XsjtU_geATJJAUH246_50w","business_id":"HYhbeLznSWEl6JIYTllVUA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Awesome dinner at Stone & Vine with my family last week. Bruschetta was great and my wife and I split a Chicken Parmigiana. The place was jumping on a weeknight, felt like a weekend. Great to see this restaurant thriving in the South Chandler area. Keep up the great food and service!","date":"2018-06-26 18:27:33"}
{"review_id":"MTH3kE2C5nITXk4xI3cBwg","user_id":"KV1MtLB3eDk0tcdM-HI8hQ","business_id":"Khs3iUmkHce7xpAyOo5kRg","stars":5.0,"useful":2,"funny":2,"cool":0,"text":"Staff is always nice and their pizza is awesome! The wings are good too! And so many other things! Great place to eat.","date":"2012-08-15 06:03:41"}
{"review_id":"bREvylT_S_X3z3N2SkjCjw","user_id":"JxWg7xlP4Yg0qEal4rsHMw","business_id":"swX3Vj3dQsz1YlCRmwNQEQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I LOVE eddies !!! Our bartender Andrew is the best! That is the main reason me and my boyfriend came back. In addition the food is great and the drinks are too!","date":"2015-11-06 03:22:48"}
{"review_id":"hBVOAK4AW9VmvOKF6vnCpQ","user_id":"JIZgx3I65P0YO_zP40--Ng","business_id":"XwJ6fZRVbxQYRsryy4-qDw","stars":4.0,"useful":2,"funny":1,"cool":2,"text":"Yes ! I like this place !!\n\nRestaurant is clean \nService is good \nPrice is not too expensive \nFood was delicious !!\n\nI don't eat Cajun seafood often\nBut I wanted try something different sometimes .... \n\nI wanna come back again !!","date":"2016-01-04 10:50:04"}
{"review_id":"hI4lqL_UpygLTkczT5VjAA","user_id":"PRJMe-RgFnCEhyy7tf3DmQ","business_id":"cj_9eTPR0JBqk9qt2VmzFw","stars":4.0,"useful":2,"funny":0,"cool":1,"text":"I come here often for Walnut cakes! 6 little delicious balls for $2! My fave are the potato and walnut, and potato and almond cakes. Walnut cakes with roasted green tea Korean style - you can't go wrong! Total: less than $4! Great snack and totally different from timbits. \n\nRun by a sweet Korean family!","date":"2016-01-30 05:10:51"}
{"review_id":"qHhYmPBa-diRFmVlD-TuwQ","user_id":"yX1_CDzyqbNspGApWWKuxQ","business_id":"lGy7jJ9oVZUJNkmZj7ewgA","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"Good variety and quantity in meals. Staff was good about making sure I was being assisted. Good for single or group.  No big deal but server forgot one item on my order and then felt like she just rushed me off..","date":"2015-08-30 18:13:44"}
{"review_id":"M0cDXY-n7Aayx3oTfuBAFQ","user_id":"8BTQuNFSbfycwMbKTO7tsQ","business_id":"-2ToCaDFpTNmmg3QFzxcWg","stars":1.0,"useful":7,"funny":4,"cool":2,"text":"This is the worst shuttle service you will ever see in your life. The whole experience was a nightmare. We departed the airport and found their booth outside and waited in line only to find out since we had a voucher we did not need a ticket. It did not state anywhere on there about that.\n\nNext we went over to stand in line and wait for the shuttle with the other 50 or so people. Shuttle took 15-20 minutes to arrive. It took another 15 minutes to load and depart and then it was another 15 minutes before another one arrived. Luckily I was able to get on that one, but what a fiasco. They have the worst service and are way too slow. They want you to call in advance to arrange your return pick up and they come and get you 2-3 hours before you need to be at the airport. F*** that. These people will never see me or any of my money again. We are taking a cab back to the airport since we are close I think it would have been cheaper just to take a cab in the first place. Never use these people they are horrible and you will regret it. Big mistake I will never make again EVER!!!!!!!!!!","date":"2013-05-07 15:41:20"}
{"review_id":"pXGdIOxiVJXrPQVAE7tb6w","user_id":"DrihjvsnmSojUo6hqz3qWw","business_id":"hIUKufhwR6Ifn7bi0-phLA","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Great food, great people.\n\nI have mad respect for a place that not only has great food (and of course vegan options) but is also run by nice people.  Food is fresh made and you I was seriously treated like a friend while i was there.  \n\nGreat lunch spot!","date":"2011-03-21 03:05:48"}
{"review_id":"BkglD0ARwdYmGLvGlIoeRQ","user_id":"9bUtVfu_u90U9-Z-57_QzQ","business_id":"9MU3oecF3ldon0u46fjYzA","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"So I returned. They fixed it for free which was kind. \nNot 2 days later they all started to peel again. This was a gel manicure which I was told would last 2 to 3 weeks. \nWhen I went back I politely asked if they could just remove it (I did not ask for any refund though I should have) and then they wanted to charge me to remove it!\nInexperienced staff and overall overpriced for all services.\nAlso, tiny for selection for charging 20 dollars extra. I chose the only neutral colour they had.","date":"2017-07-08 19:06:31"}
{"review_id":"dv_48vwQtgo_lWBdKj3DmA","user_id":"186mXS6Jux7ZQcbXEWri6w","business_id":"AwlvIsKDqB5LeKNWC6k4kQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Great museum, great collections, great special shows. As good or better than the Los Angeles county collections. Maybe the only free museum in the USA ?","date":"2018-10-04 10:27:38"}
{"review_id":"kkRZdB0zDZ0LAZsUrkbEpQ","user_id":"LaDUO7LhjIaxFnYRuglnBQ","business_id":"LBMscuMxayVQBPrNyH3VRw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"We realized last night that our tires were not in great shape. After reading the Yelp reviews, we decided to give Discount Tire a try. I am so glad we did. \n\nWe got there right at 7:15 am and were the first people in the garage. We were out by 7:30, and would've been sooner if I'd realized that our car had a wheel lock. We got four tires installed on our Jetta for less than $275. \n\nWe will absolutely be back the next time our car needs tires. Thank you so much to Discount Tire for being so quick and friendly!","date":"2017-03-15 12:06:13"}
{"review_id":"N7H7OvsVZRvSc3_IpOUP1w","user_id":"SNANQQzUYiGpS1HoguNeJw","business_id":"NFm869_w6cvVaWaNpAzjeA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Soul has a very music vibe with upbeat music an extensive menu and creative drinks. The truffle fries are awesome and their entire sushi menu is great! Will definitely be coming back again and again!","date":"2016-03-31 02:14:26"}
{"review_id":"NmS7AqBGV5_VWpQw4EOGyw","user_id":"dcjVGc15CHFkhXo_kimGLg","business_id":"5Is2e7xYtaiTEJ1dLkGR6Q","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I try the new french toast plate with bacon...\nDelicious!!!\nThey have my favorite cashier at graveyard.  No matters what time is   she is all the time happy and friendly..   i love to come to this jack...","date":"2017-02-19 20:10:00"}
{"review_id":"ZVIYd4iy_bh7bF1W_0UTAg","user_id":"ZefHQwjj3b7mxi46oKik-g","business_id":"kG_EB5RAsSA3f9HJikI1rw","stars":4.0,"useful":1,"funny":0,"cool":1,"text":"First timer here, we've been wanting to come here for a little while. From the reviews it seemed like we needed to get here early. Luckily for us we're old ppl trapped in young bodies so we tend to go out very early so we didn't have any issue with seating, of course this was at 16:00. \nThe staff gets a 5 star for being awesome. The burgers were good, but for $11-15 by themselves I'm not too sure. Maybe I'll try the kobe beef next time. The shakes are pretty good too. Out of the whole thing I'd say the fries and shake were our favorite. We will definitely swing in for the shakes and the loaded fries (we didn't get the loaded this time).","date":"2016-06-11 23:28:22"}
{"review_id":"_eVKmxaeFvDSS_QlIVYcuw","user_id":"FktJs8-8GWpB7JQqJDsjQw","business_id":"lEXpXVDt5xKGg6hOmRcTGg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"The food tastes really homemade :) I had the goulash which was super tasty and the chicken paprikash- both really good! The server was very sweet and friendly too. My only issue was that the dubonet I ordered came in a pretty dusty glass but the server apologized right away and brought me a new one when I told her.","date":"2017-12-16 02:42:36"}
{"review_id":"EFDw4fBbnxiPGNUgYAkJcw","user_id":"VtaAIVhIqLxFCoGJzrMqtA","business_id":"46Ld9Qc9nAx_A0jwclNZiw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Dope sandwiches. Super quick service. A little expensive but hey. Better than every other cheap restaurant in the neighbourhood!!!","date":"2017-09-09 05:57:13"}
{"review_id":"FvU_TGs6fQ1KmwsqT0pm8Q","user_id":"tDGWLXur7KpgT_3-oX1qfA","business_id":"Rj3wnYT1QAxpJlRT5mMc-g","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"The food was amazing but, a super inconvenience that they can't split checks. You're in the customer service industry and dividing payments is a huge part of that. The fact that it's such a hassle makes me second guess coming here. You need to upgrade your payment method to accommodate you're customers. Other than that service was good!","date":"2015-08-30 19:47:10"}
{"review_id":"XKzMXhBXCDe6GmkKJ0i-Sg","user_id":"4cAXYVhqN1qXocVuAu5bwA","business_id":"yNPh5SO-7wr8HPpVCDPbXQ","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"The steak and the spot prawns or spot-on! Cooked to perfection seasoned with love and I ate with great passion.  Was like love in my heart except it was in my mouth.","date":"2018-08-23 22:20:48"}
{"review_id":"WvkkHRWnzgEGqALCFR5ZGQ","user_id":"Oy_IBZThkZB_KHdX92HJqQ","business_id":"PLVGvzeCY7hqTLqHBGVflg","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"Kick off your high heels and peel off that tight dress!  This is the place to unwind.  \n\nWe arrived 20 minutes before our services began.  I learned next time to go even earlier than that to make use of the great amenities.  \n\nAfter filling out a little paperwork we waited were escorted to our separate wings.  \n\nThe girl gave me slippers, robe, and a locker.  I only had time to change into my robe (they have private changing rooms) and gulp down a cup of ice water.  \n\nI had one of the SIGNATURE RITUALS package.  My body melted!  Afterward, I used the steam and dry sauna.  Make sure to grab a cucumber iced towel (and a few cucumbers for your eyes) before you head into the sauna.  They have an endless supply of towels ready for you inside the spa.  Once you are exhausted from sweating out alcohol through your pores, get something to drink\/eat in their dimly lit room.  There are magazines and a TV.  When you're ready for your shower they have razors, shampoo, conditioner, and body wash for you.  ENJOY!","date":"2011-03-20 07:56:00"}
{"review_id":"lwQfz4AHJFqFTAQBh4VbXw","user_id":"ciXjBfJrAEteIKpzZg4I9g","business_id":"EitmPDRgpaBlWiaAoaxTwQ","stars":4.0,"useful":3,"funny":0,"cool":0,"text":"I like to bowl about once a year & this fit the bill!  We went on a Thursday afternoon & they had a special to bowl unlimited games with unlimited pizza for two hours for $14\/pp.  We weren't hungry & said no to the special until she told us the total ($70???) so we got the special & just didn't have pizza.  The alley is nice & they played an excellent mix of music with the videos on the big screens at the end of the alley (even a Jerry Lee Lewis video from the 50's!!!)  They even have a \"jukebox to choose music from.  The staff was pleasant & very helpful & even picked out the perfect ball for me before I even asked (they are behind the counter).  They have 1\/2 sized shoes so we bowled away & had a great time!  (I broke 100 twice & my sweetie broke 150!)  The were several people\/families bowling & everyone was polite & appropriately behaved (always a plus)","date":"2012-01-04 02:38:18"}
{"review_id":"cvAE5nti180MovnAG1g_5w","user_id":"l38MZfugtTB-ysHAcsnZqA","business_id":"oaqbLDW3wNqkynlnp4mvlw","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"The clams were super salty, should have sent them back but didn't. The octopus was on hit but lasagna was bland and only like 2 bites could taste the meat. Puck needs to step up and put some time at this place! Barely made 3 stars for me!!!","date":"2017-08-29 00:56:07"}
{"review_id":"lAo9LJ0MDykZ6RfNVbRGQQ","user_id":"zEOuNc4K40aw-GE6y8RgIg","business_id":"Y6FNieFd5UKhJ3a6FbQhyg","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Come here when you want a generic breakfast. The crepes were great. Everything is just good, nothing incredible, but will live up to your expectations of iHop.","date":"2014-07-28 03:39:45"}
{"review_id":"g-nag0GW1s-5JVfJkIkH4w","user_id":"QyzC2gO-ng5qF_nDnjda6Q","business_id":"YKBG7809dSRjo2FteH5Dzw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"daily I go get my beverage from this starbucks because its clean there fast and everyone that works there is always polite and friendly.","date":"2014-02-24 07:01:22"}
{"review_id":"lB63qw3aHfZ2QAGiQx8RwQ","user_id":"TlVlPWyB7PyHFI0aXVDVhw","business_id":"k1c_bC3DK6mKg797vH1T8w","stars":3.0,"useful":1,"funny":0,"cool":1,"text":"Really sharp decor.  \n\nDecent service but nothing special.  Busy, even late night on a weekday so not too inviting or personalized.\n\nCan't say that I was too impressed with their mixed drinks.\n\nSelected the grilled cheese and tomato soup as a starter.  Divine.  Vegtable Chop Salad with pumpkin brittle was so tasty.","date":"2011-03-20 01:14:11"}
{"review_id":"EX2Tj_-lXRIjd_DSlPx0dw","user_id":"9DHdSuJTp3iD7qUWOvnOEQ","business_id":"dFpSjdNOfIMBPJOIHES45Q","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Awesome hand decorated for any type of events. I brought these cookies to an event in California fee years and they were a hit!","date":"2018-01-21 19:37:31"}
{"review_id":"g9r7NZ66R5-Me7nQ-JE0GQ","user_id":"xi-VvKup2YjvA0Syr8fjbQ","business_id":"ajWAVO3L3bFTpk3SVo9JcQ","stars":1.0,"useful":1,"funny":1,"cool":0,"text":"Gun Range Closed.\nAll the signs and advertisements we saw said open 7 days a week 9am-7pm.\nWasted Lyft ride and an hour.\nDisappointed, employees just cleaning, no one available to give us a ride.\nSad","date":"2016-05-19 17:12:26"}
{"review_id":"nKAKdq06jqdxZuaOBY0KXg","user_id":"h0YuVXpwDPRkNFoCKmk5_A","business_id":"WBxR9IC6E9-4szNzq7_Y3Q","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"I found this place by accident while trying to find a different Thai restaurant, but I'm sure glad I wound up here. I stopped in for a lunch special which came with soup, rice, small fried spring roll, and entree. The soup was rather plain and unimpressive  the stir fried beef on the other hand was quite tasty. The sauce they used was delicious. And when I said I wanted it spicy, they sure made it spicy! Good on them. The employees were all very nice and accommodating as well. Highly recommended.","date":"2013-10-03 22:16:14"}
{"review_id":"zcmDqOfDlo3a8Q6GwPSW4A","user_id":"UQl5EpV2UHL1juulvk407w","business_id":"Ul6JwluSTm12PVDIqnNaTg","stars":4.0,"useful":0,"funny":0,"cool":1,"text":"This is an amazing place!  Great atmosphere, very clean, beautiful bar, and most importantly, great food!\n\nShoot for the fish tacos; yum!!!\n\nThe only reason I didn't rate this a 5 star was due to the service being quite slow and lackluster. Other than that, GO NOW!","date":"2013-12-29 22:26:17"}
{"review_id":"iwwcoLsHoFjsriawLaBIZA","user_id":"R99v673_uirpHCt5-5O8Cg","business_id":"2ROJpByFqGaMdsWSleHg2g","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Not cheap, but fast, efficient, and courteous.  Called warranty company Old Republic and they sent AM\/PM PLUMBING and got the run around for 2 days. 3 toilets and 2 showers with NO drainage.  In the end, called Apple Plumbing on my own.  Came out same day, Grant was courteous, on time, AND FIXED THE PROBLEM with a 75 foot line from the roof, the tech used about 65 feet of his line and AM\/PM told me he couldn't fix it with 100 foot line (lies lies).  Just FYI -Don't flush Costco Kirkland \"flushable\" wipes, they don't break down.  This company was there for us and we won't forget it.  Thanks for your help!!!","date":"2013-10-25 01:40:59"}
{"review_id":"XZoTPWjVhXeuSuyy8q9TGg","user_id":"3kWltF8RUs05nzFp4nEwEg","business_id":"YywWkWX235ZurTWSLqNPog","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This is the only place we come for Chaat!!!! Mouth watering....you will keep going back for more :-)","date":"2017-10-11 03:56:51"}
{"review_id":"KLi05cNdmSRmIr4shV_-kw","user_id":"GA_4WwxEbtV5Vp0LLCfQ9g","business_id":"GSplpfgI99c28ERoNDA4vA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Awesome little dive bar and billiards. My friend is a member so we went on a Wednesday night. It was not crowded, and there was a nice selection of liquors and bottled beer. We were not charged for a pool table, its first come, first serve. We played pool for about 3 hours and had several drinks during that time. The bill was so reasonable, I had to check to make sure that everything had been put on our bill. This is a place I would come back to whenever I am in Charlotte.","date":"2017-05-13 19:45:36"}
{"review_id":"6gpGqYf-54i4TfZyN2JXuw","user_id":"owbC7FP8SNAlwv6f9S5Stw","business_id":"-wDNRL4lm1UgeFLG9KcrjQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Well I ordered from here again and it was great!!!!!\n\nBoyfriend tried the Oh no roll 2!  He said it was excellent! He really liked the  fried soft shell crab on it.\nFor the first time we tried the Mexican roll... It really tasted like a Mexican! A little bell pepper kind of light jalapeo. Was really good! The crab they use it very good! Most places use imitation crab, not sure if they do, either way its pretty good.\nCrab rangoon has great wonton crisp. Nice and thick, not oily.\n\nI love their Philadelphia Roll, but I get it with shrimp instead of salmon. The BEST!\n \nThe avocado roll should be called The Green Marshmallow,( so fluffy)  I think its the best avocado roll in vegas... Its so simple but packed with avocado! \nYoung man took my order he was very friendly and got my order perfect!\n\nOnce again the wasabi was disgusting but I have my own. I learned from the last times.","date":"2014-04-20 00:18:21"}
{"review_id":"v8VArSFaHBk_T3D5Wr83-Q","user_id":"tLl6nrX280K-7crTpeTwTw","business_id":"5gvD6y7BK1E1EoQ6YaR04A","stars":2.0,"useful":2,"funny":0,"cool":0,"text":"I don't know if anyone else has noticed that these cigs are less and less satisfying than they used to be when this place first opened.  ???  Myself and a few people I know have been getting ryo cigs at these stores for a few years now....and the tobacco has progressively been getting worse and worse.  Meaning....the low level of nicotine in the tobacco is not satisfying at all!  I can smoke 3 cigs in a row....and barely feel like I got any nicotine.  And the shit inside the tobacco burns like a god damn forest fire!  It smells like wood or plastic or I don't know what.  They smoke like crazy!  And they burn a lot faster too!  I can tell you that the Kentucky Tobacco they bought back when these places opened....is NOT the same as the shitty tobacco they get today...but still call it the \"same Kentucky Tobacco\".  And try to explain this to someone that works at these places who doesn't even smoke....is like talking to the wall.  I know the owners have got to know that this tobacco really sucks now.  But I guess they figure...you get what you get.  Clearly they are getting much cheaper tobacco than in the past.  It's almost like it's 30% normal tobacco and 70% who the hell knows?  But what I do know is....it's a fraction of the nicotine that was in the original Kentucky Tobacco they used to get and now it sets off the damn smoke detectors in my house from them burning like a camp fire!  Good things never last.","date":"2014-11-30 06:02:38"}
{"review_id":"MZhz0VSHhazSN0nXC3ghAA","user_id":"kJW-GI7ig2cF7IQQAPd83Q","business_id":"6xGlz2tG5fjSNOsN2kU5Bw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"My favorite Chinese takeout place that I've found around the Ballantyne area. Doesn't look amazing on the inside but we never eat in. I usually order the chicken and broccoli and last time I went for the garlic shrimp. I'm always scared to try new things but I loved it! New favorite. The portions are huge. We often eat down for dinner and have lunch the next day too from one serving. We also order it with chicken fried rice which is way better than the pork fried rice most dishes automatically come with. Think it's $1 extra. They have the lowest prices of any Chinese food places we've been too around here.","date":"2015-04-01 21:55:48"}
{"review_id":"S2ECnHqPgTsr0S3csJG3XA","user_id":"nRxjaVrNn7Q9m2N5mBCewQ","business_id":"bsrj9_hFAql3dlSf244zpg","stars":3.0,"useful":1,"funny":0,"cool":1,"text":"Very beautiful. Service some times is great. You have to stand around looking for valet or super slow food. \n\nFor some reason phone service is spotty in hotel room. Not sure why this is. \n\nYou can find rooms for $90 \/night if you look often on sites","date":"2013-11-15 03:20:33"}
{"review_id":"rD_jVZ7ZpYYMBkbxPBhbIQ","user_id":"R90RWAQ0K28SP2YYyT5l1w","business_id":"0JqPI6mv7xHloURlf0L4Mg","stars":4.0,"useful":0,"funny":1,"cool":0,"text":"The dishes are delicious, I had curry fish (extra hot) and the first soup on the menu, those are good. The price was about $20, do not have much traditional tai food, more like those express food style but with nice dining environment. Good for a express, but so good as a dinner restaurant.","date":"2015-06-21 05:16:20"}
{"review_id":"JGHnRaqxpyx6KJcZhXHRZQ","user_id":"ast2CVOKDTZQxk5gXPzK0w","business_id":"Dt-ygvMchiw0wrWpocGOeg","stars":2.0,"useful":0,"funny":0,"cool":0,"text":"Food is delicious but I can't leave a positive review here\nOverpriced and under filling","date":"2016-07-25 13:46:26"}
{"review_id":"O_dymxhQrr1zxna8lE6XeQ","user_id":"JND3m3btns9ws5xNL_mWIw","business_id":"ZIUs7gncPOX0OXr1ZYviAQ","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"My fiance and I are Las Vegas locals, and often frequent the restaurants in the Henderson\/Green Valley area.  As folks who work in the service and hospitality industries ourselves, we are often on the look out for restaurants that offer both good service and great food!  King's Fish House is one of the better seafood restaurants in Las Vegas, and has a good reputation.  We have been to this place before, and almost always have a great time.  The menu is huge, with many items to choose from (not just seafood); in fact, on my most recent visit here, I ordered a Southwestern Salad with blackened chicken.  Our server was a great guy with a lot of information on the menu  items.  He offered some suggestions to help us decide which items we would choose for lunch, and he was courteous and personable.  A win-win!\n\nKing's Fish House has definitely taken a more hand's-on approach to making sure that the service is great and that the food comes out fresh and in a timely manner.  Always a bonus when you visit a restaurant with a good reputation and it holds up over time.  I highly recommend this place for lunch, dinner or their awesome desserts","date":"2012-06-26 21:11:39"}
{"review_id":"8gutP6gdpmE9Ugwu37kFRg","user_id":"LskzN1LyePqeVLTv6BWl4Q","business_id":"1Gn3uBluQgNc_G5ExF3gHQ","stars":1.0,"useful":1,"funny":0,"cool":0,"text":"Bought a car in 2012 and it was a decent experience.  What has been living hell is receiving calls during work and at home every two days trying to refinance my car - a car I sold two years ago.  Despite SEVERAL requests for them to permanently purge my information and phone number from their system, I still get a minimum of 3 calls a week trying to refinance a car that I DON'T OWN.\n\nWho knew that the vultures have turned to full on harassment.  I'm fully expecting them to start knocking in my door every  night at some point...","date":"2017-04-30 05:16:31"}
{"review_id":"BYvW4IEYurgISKcF6b-X8A","user_id":"G6xEgW91ZxVxjujMt3p0_A","business_id":"QfWFxmXqRGixztgaZN0gOA","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"My favorite coffee shop on the west side of Madison, super friendly staff and owners, I see a lot of people I know when I go there, I love the atmosphere, especially the outdoor patio. Plus they have fantastic food and coffee","date":"2018-07-26 13:06:26"}
{"review_id":"7QQK5-PKWjsXRL-_ESiepw","user_id":"wV4kfIzq0Mh9DBdloU5Ymw","business_id":"-fiUXzkxRfbHY9TKWwuptw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"This restaurant an amazing place to stop while traveling especially for gluten free food. The town is cute and the food was great. The cedar plank salmon was a one sitting proportion. It tasted great. The gluten free options were limited but were different from what is typical when eating out.  The squash and cashew meal was delicious. I highly recommend it.","date":"2016-11-21 19:49:40"}
{"review_id":"QIx8Nb2-SNnqWKNbnM20vg","user_id":"hHhSmytOPwOfbsIPQrbtzg","business_id":"5CJL_2-XwCGBmOav4mFdYg","stars":1.0,"useful":2,"funny":0,"cool":0,"text":"The only good that came from eating here was that the bill was comped.\n\nWent for dinner 22 April. Everything was fine up until the part where people actually eat, which is a major issue being a restaurant. Two distinctly different dishes were ordered; yellow curry with tofu and Seafood Delight. Hers came out in a reasonable amount of time. I told her to not wait for me and eat, believing my order would be coming out shortly.\n\nMeanwhile, a table of two came in, and was seated at a table that was in my line of sight. They got their drinks, ordered and started to eat\n\nEvery so often, staff would peek around to see me, sitting there not eating. Eventually, one of the waitresses comes over.\n\n\"Is everything okay?\nEverything except I haven't received my order.\"\n\nMinutes later...\n\n\"Is everything okay?\nIs there something wrong in the kitchen? I'm still waiting for my food.\"\n\nHer response was that the order slipped through the cracks because of a larger party's (20+) order, which doesn't sound right. The party she was talking about was already seated and eating when we walked in, and the table that was seated in my line of sight came in after us and was already eating. Additionally, our order was taken on one ticket, not two (2) separate orders, so both orders should have been started at the same time\n\nMy plate finally shows up, but I'm so upset that I don't eat. For five minutes, I debate whether or not to ask for the manager. And again, every so often the staff would peek around to see me, sitting there and not eating. Was finally persuaded to just eat so we can leave.\n\nWe had finished our meals. The male waiter shows up, and asks how things are going. She had asked for a to go container, which was brought promptly. She filled the container with her leftovers, and the dishes were taken away.\n\nWe sat around for another 15 minutes. No one bothered to ask if we were ready for our check. That table of two? Already out the door. While we were waiting, we had a talk about her talking with management, because I knew she would be calmer than I would be. We go to the front and had to ask the hostess we would like to pay, but we never received a bill.\n\n\"What table was yours?\nThe table that had to wait over fifteen minutes for my dinner.\"\n\nAt that point, I pulled $25 out of my pocket, and handed it to her while taking her take out container. Was so livid that I told the hostess that she had something to say to management and I had to leave\n\nShe finally came out, and I got the lowdown.\n\n- A lot of apologies were given, but no real action to correct the situation (Which I take as, no one cares enough to follow up)\n- Of the three wait staff (2 F, 1 M) who came to our table, not once did the male member mention he was the manager\n- Lots of finger pointing going around: waitress(es) believed since the manager came over, he would take care of us; manager believed waitress(es) was still serving us.","date":"2012-04-28 16:02:06"}